einergehtnochrein/ra-firmware/core/Device/NXP/LPC54xxx/Include/LPC5411x.h

#ifndef __LPC541xx_H__
#define __LPC541xx_H__

// ------------------------------------------------------------------------------------------------
// -----                              Interrupt Numbers                                       -----
// ------------------------------------------------------------------------------------------------

typedef enum IRQn {
    /******  Cortex-M4 Processor Exceptions Numbers ***************************************************/
    NonMaskableInt_IRQn         = -14,      /*!< 2 Non Maskable Interrupt                         */
    MemoryManagement_IRQn       = -12,      /*!< 4 Cortex-M3 Memory Management Interrupt          */
    BusFault_IRQn               = -11,      /*!< 5 Cortex-M3 Bus Fault Interrupt                  */
    UsageFault_IRQn             = -10,      /*!< 6 Cortex-M3 Usage Fault Interrupt                */
    SVCall_IRQn                 = -5,       /*!< 11 Cortex-M3 SV Call Interrupt                   */
    DebugMonitor_IRQn           = -4,       /*!< 12 Cortex-M3 Debug Monitor Interrupt             */
    PendSV_IRQn                 = -2,       /*!< 14 Cortex-M3 Pend SV Interrupt                   */
    SysTick_IRQn                = -1,       /*!< 15 Cortex-M3 System Tick Interrupt               */

    /******  LPC5411x Specific Interrupt Numbers *******************************************************/
    WDT_BOD_IRQn                = 0,
    DMA_IRQn                    = 1,
    GINT0_IRQn                  = 2,
    GINT1_IRQn                  = 3,
    PIN_INT0_IRQn               = 4,
    PIN_INT1_IRQn               = 5,
    PIN_INT2_IRQn               = 6,
    PIN_INT3_IRQn               = 7,
    UTICK_IRQn                  = 8,
    MRT_IRQn                    = 9,
    TIMER0_IRQn                 = 10,
    TIMER1_IRQn                 = 11,
    SCT0_IRQn                   = 12,
    TIMER3_IRQn                 = 13,
    FLEXCOMM0_IRQn              = 14,
    FLEXCOMM1_IRQn              = 15,
    FLEXCOMM2_IRQn              = 16,
    FLEXCOMM3_IRQn              = 17,
    FLEXCOMM4_IRQn              = 18,
    FLEXCOMM5_IRQn              = 19,
    FLEXCOMM6_IRQn              = 20,
    FLEXCOMM7_IRQn              = 21,
        I2C0_IRQn                   = FLEXCOMM0_IRQn,
        I2C1_IRQn                   = FLEXCOMM1_IRQn,
        I2C2_IRQn                   = FLEXCOMM2_IRQn,
        I2C3_IRQn                   = FLEXCOMM3_IRQn,
        I2C4_IRQn                   = FLEXCOMM4_IRQn,
        I2C5_IRQn                   = FLEXCOMM5_IRQn,
        I2C6_IRQn                   = FLEXCOMM6_IRQn,
        I2C7_IRQn                   = FLEXCOMM7_IRQn,
        SPI0_IRQn                   = FLEXCOMM0_IRQn,
        SPI1_IRQn                   = FLEXCOMM1_IRQn,
        SPI2_IRQn                   = FLEXCOMM2_IRQn,
        SPI3_IRQn                   = FLEXCOMM3_IRQn,
        SPI4_IRQn                   = FLEXCOMM4_IRQn,
        SPI5_IRQn                   = FLEXCOMM5_IRQn,
        SPI6_IRQn                   = FLEXCOMM6_IRQn,
        SPI7_IRQn                   = FLEXCOMM7_IRQn,
        UART0_IRQn                  = FLEXCOMM0_IRQn,
        UART1_IRQn                  = FLEXCOMM1_IRQn,
        UART2_IRQn                  = FLEXCOMM2_IRQn,
        UART3_IRQn                  = FLEXCOMM3_IRQn,
        UART4_IRQn                  = FLEXCOMM4_IRQn,
        UART5_IRQn                  = FLEXCOMM5_IRQn,
        UART6_IRQn                  = FLEXCOMM6_IRQn,
        UART7_IRQn                  = FLEXCOMM7_IRQn,
    ADC0_SEQA_IRQn              = 22,
    ADC0_SEQB_IRQn              = 23,
    ADC0_THCMP_IRQn             = 24,
    DMIC_IRQn                   = 25,
    HWVAD_IRQn                  = 26,
    USB_NEEDCLK_IRQn            = 27,
    USB_IRQn                    = 28,
    RTC_IRQn                    = 29,
    EZH_IRQn                    = 30,
    MAILBOX_IRQn                = 31,

    PIN_INT4_IRQn               = 32,
    PIN_INT5_IRQn               = 33,
    PIN_INT6_IRQn               = 34,
    PIN_INT7_IRQn               = 35,
    TIMER2_IRQn                 = 36,
    TIMER4_IRQn                 = 37,

    IRQ38_IRQn                  = 38,
    IRQ39_IRQn                  = 39,
} IRQn_Type;


/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M3 Processor and Core Peripherals */
#define __MPU_PRESENT             1         /*!< MPU present or not                               */
#define __FPU_PRESENT             1
#define __NVIC_PRIO_BITS          3         /*!< Number of Bits used for Priority Levels          */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used     */


#include "core_cm4.h"                       /* Cortex-M4 processor and core peripherals           */
//#include "system_LPC54xxx.h"                   /* System Header                                      */


/******************************************************************************/
/*                Device Specific Peripheral registers structures             */
/******************************************************************************/

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif


// ------------------------------------------------------------------------------------------------
// -----                                          ADC                                         -----
// ------------------------------------------------------------------------------------------------

typedef struct {
    __IO uint32_t CTRL;
    __I  uint32_t RESERVED004[(0x008-0x004)/4];
    __IO uint32_t SEQA_CTRL;
    __IO uint32_t SEQB_CTRL;
    __IO uint32_t SEQA_GDAT;
    __IO uint32_t SEQB_GDAT;
    __I  uint32_t RESERVED018[(0x020-0x018)/4];
    union {
        __I  uint32_t DAT[12];
        struct {
            __I  uint32_t DAT0;
            __I  uint32_t DAT1;
            __I  uint32_t DAT2;
            __I  uint32_t DAT3;
            __I  uint32_t DAT4;
            __I  uint32_t DAT5;
            __I  uint32_t DAT6;
            __I  uint32_t DAT7;
            __I  uint32_t DAT8;
            __I  uint32_t DAT9;
            __I  uint32_t DAT10;
            __I  uint32_t DAT11;
            __I  uint32_t DAT12;
        };
    };
    __IO uint32_t THR0_LOW;
    __IO uint32_t THR1_LOW;
    __IO uint32_t THR0_HIGH;
    __IO uint32_t THR1_HIGH;
    __IO uint32_t CHAN_THRSEL;
    __IO uint32_t INTEN;
    __IO uint32_t FLAGS;
    __IO uint32_t STARTUP;
    __IO uint32_t CALIB;
} LPC_ADC_Type;


// ------------------------------------------------------------------------------------------------
// -----                                         CRC                                          -----
// ------------------------------------------------------------------------------------------------

