einergehtnochrein/ra-firmware/core/Device/NXP/LPC54xxx/Include/LPC5411x.h
typedef struct {
    __IO uint32_t MODE;
    __IO uint32_t SEED;
    union {
        __I  uint32_t SUM;
        __O  uint32_t WR_DATA;
        __O  uint32_t WR_DATA32;
        __O  uint16_t WR_DATA16;
        __O  uint8_t  WR_DATA8;
    };
} LPC_CRC_Type;



// ------------------------------------------------------------------------------------------------
// -----                                        DMIC                                          -----
// ------------------------------------------------------------------------------------------------

typedef struct {
    __IO uint32_t OSR0;
    __IO uint32_t DIVHFCLK0;
    __IO uint32_t PREAC2FSCOEF0;
    __IO uint32_t PREAC4FSCOEF0;
    __IO uint32_t GAINSHIFT0;
    __I  uint32_t RESERVED014[(0x080-0x014)/4];
    __IO uint32_t FIFOCTRL0;
    __IO uint32_t FIFOSTAT0;
    __IO uint32_t FIFODATA0;
    __IO uint32_t PDMSRCCFG0;
    __IO uint32_t DCCTRL0;
    __I  uint32_t RESERVED094[(0x100-0x094)/4];

    __IO uint32_t OSR1;
    __IO uint32_t DIVHFCLK1;
    __IO uint32_t PREAC2FSCOEF1;
    __IO uint32_t PREAC4FSCOEF1;
    __IO uint32_t GAINSHIFT1;
    __I  uint32_t RESERVED114[(0x180-0x114)/4];
    __IO uint32_t FIFOCTRL1;
    __IO uint32_t FIFOSTAT1;
    __IO uint32_t FIFODATA1;
    __IO uint32_t PDMSRCCFG1;
    __IO uint32_t DCCTRL1;
    __I  uint32_t RESERVED194[(0xF00-0x194)/4];

    __IO uint32_t CHANEN;
    __I  uint32_t RESERVEDF04[(0xF0C-0xF04)/4];
    __IO uint32_t IOCFG;
    __IO uint32_t USE2FS;
    __I  uint32_t RESERVEDF14[(0xF80-0xF14)/4];

    __IO uint32_t HWVADGAIN;
    __IO uint32_t HWVADHPFS;
    __IO uint32_t HWVADST10;
    __IO uint32_t HWVADRSTT;
    __IO uint32_t HWVADTHGN;
    __IO uint32_t HWVADTHGS;
    __I  uint32_t HWVADLOWZ;
} LPC_DMIC_Type;


// ------------------------------------------------------------------------------------------------
// -----                                       FLEXCOMM                                       -----
// ------------------------------------------------------------------------------------------------

typedef struct {
    __I  uint32_t RESERVED000[(0xFF8-0x000)/4];
    __IO uint32_t PSELID;
    __I  uint32_t PID;
} LPC_FLEXCOMM_Type;



// ------------------------------------------------------------------------------------------------
// -----                                         GPIO                                         -----
// ------------------------------------------------------------------------------------------------

typedef struct {
    union {
        __IO uint8_t B[41];
        struct {
            __IO uint8_t B0;
            __IO uint8_t B1;
            __IO uint8_t B2;
            __IO uint8_t B3;
            __IO uint8_t B4;
            __IO uint8_t B5;
            __IO uint8_t B6;
            __IO uint8_t B7;
            __IO uint8_t B8;
            __IO uint8_t B9;
            __IO uint8_t B10;
            __IO uint8_t B11;
            __IO uint8_t B12;
            __IO uint8_t B13;
            __IO uint8_t B14;
            __IO uint8_t B15;
            __IO uint8_t B16;
            __IO uint8_t B17;
            __IO uint8_t B18;
            __IO uint8_t B19;
            __IO uint8_t B20;
            __IO uint8_t B21;
            __IO uint8_t B22;
            __IO uint8_t B23;
            __IO uint8_t B24;
            __IO uint8_t B25;
            __IO uint8_t B26;
            __IO uint8_t B27;
            __IO uint8_t B28;
            __IO uint8_t B29;
            __IO uint8_t B30;
            __IO uint8_t B31;
            __IO uint8_t B32;
            __IO uint8_t B33;
            __IO uint8_t B34;
            __IO uint8_t B35;
            __IO uint8_t B36;
            __IO uint8_t B37;
            __IO uint8_t B38;
            __IO uint8_t B39;
            __IO uint8_t B40;
        };
    };
         uint8_t _RESERVED0_[4096-41];
    __IO uint32_t W[41];
         uint32_t _RESERVED1_[1024-41];
    union {
        __IO uint32_t DIR[2];
        struct {
            __IO uint32_t DIR0;
            __IO uint32_t DIR1;
        };
    };
         uint32_t _RESERVED2_[32-2];
    union {
        __IO uint32_t MASK[2];
        struct {
            __IO uint32_t MASK0;
            __IO uint32_t MASK1;
        };
    };
         uint32_t RESERVED3[32-2];
    union {
        __IO uint32_t PIN[2];
        struct {
            __IO uint32_t PIN0;
            __IO uint32_t PIN1;
        };
    };
         uint32_t RESERVED4[32-2];
    union {
        __IO uint32_t MPIN[2];
        struct {
            __IO uint32_t MPIN0;
            __IO uint32_t MPIN1;
        };
    };
         uint32_t RESERVED5[32-2];
    union {
        __IO uint32_t SET[2];
        struct {
            __IO uint32_t SET0;
            __IO uint32_t SET1;
        };
    };
         uint32_t RESERVED6[32-2];
    union {
        __O  uint32_t CLR[2];
        struct {
            __IO uint32_t CLR0;
            __IO uint32_t CLR1;
        };
    };
    __I  uint32_t RESERVED2288[(0x2300-0x2288)/4];
    union {
        __O  uint32_t NOT[2];
        struct {
            __O  uint32_t NOT0;
            __O  uint32_t NOT1;
        };
    };
    __I  uint32_t RESERVED2308[(0x2380-0x2308)/4];
    union {
        __O  uint32_t DIRSET[2];
        struct {
            __O  uint32_t DIRSET0;
            __O  uint32_t DIRSET1;
        };
    };
    __I  uint32_t RESERVED2388[(0x2400-0x2388)/4];
    union {
        __O  uint32_t DIRCLR[2];
        struct {
            __O  uint32_t DIRCLR0;
            __O  uint32_t DIRCLR1;
        };
    };
    __I  uint32_t RESERVED2408[(0x2480-0x2408)/4];
    union {
        __O  uint32_t DIRNOT[2];
        struct {
            __O  uint32_t DIRNOT0;
            __O  uint32_t DIRNOT1;
        };
    };
} LPC_GPIO_Type;


// ------------------------------------------------------------------------------------------------
// -----                                    GPIO_GROUP_INT0/1                                   -----
// ------------------------------------------------------------------------------------------------

