einergehtnochrein/ra-firmware/core/Device/NXP/LPC54xxx/Include/LPC5411x.h
typedef struct {
    __IO uint32_t CTRL;
    __I  uint32_t RESERVED004[(0x020-0x004)/4];
    union {
        __IO uint32_t PORT_POL[2];
        struct {
            __IO uint32_t PORT_POL0;
            __IO uint32_t PORT_POL1;
        };
    };
    __I  uint32_t RESERVED02C[(0x040-0x028)/4];
    union {
        __IO uint32_t PORT_ENA[2];
        struct {
            __IO uint32_t PORT_ENA0;
            __IO uint32_t PORT_ENA1;
        };
    };
} LPC_GPIO_GROUP_INT_Type;


// ------------------------------------------------------------------------------------------------
// -----                                     GPIO_PIN_INT                                     -----
// ------------------------------------------------------------------------------------------------

typedef struct {
    __IO uint32_t ISEL;
    __IO uint32_t IENR;
    __IO uint32_t SIENR;
    __IO uint32_t CIENR;
    __IO uint32_t IENF;
    __IO uint32_t SIENF;
    __IO uint32_t CIENF;
    __IO uint32_t RISE;
    __IO uint32_t FALL;
    __IO uint32_t IST;
    __IO uint32_t PMCTRL;
    __IO uint32_t PMSRC;
    __IO uint32_t PMCFG;
} LPC_GPIO_PIN_INT_Type;


// ------------------------------------------------------------------------------------------------
// -----                                          I2C                                         -----
// ------------------------------------------------------------------------------------------------

typedef struct {
    __IO uint32_t CFG;
    __IO uint32_t STAT;
    __IO uint32_t INTENSET;
    __O  uint32_t INTENCLR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t CLKDIV;
    __I  uint32_t INTSTAT;
         uint32_t _RESERVED1_;
    __IO uint32_t MSTCTL;
    __IO uint32_t MSTTIME;
    __IO uint32_t MSTDAT;
         uint32_t _RESERVED2_[5];
    __IO uint32_t SLVCTL;
    __IO uint32_t SLVDAT;
    union {
        struct {
            __IO uint32_t SLVADR0;
            __IO uint32_t SLVADR1;
            __IO uint32_t SLVADR2;
            __IO uint32_t SLVADR3;
        };
        __IO uint32_t SLVADR[4];
    };
    __IO uint32_t SLVQUAL0;
         uint32_t _RESERVED3_[9];
    __IO uint32_t MONRXDAT;
} LPC_I2C_Type;



// ------------------------------------------------------------------------------------------------
// -----                                       INPUTMUX                                       -----
// ------------------------------------------------------------------------------------------------

typedef struct {
    __I  uint32_t RESERVED000[(0x0A0-0x000)/4];

    union {     /* 0x0A0 */
        struct {
            __IO uint32_t EZH_SLICE_INMUX0;
            __IO uint32_t EZH_SLICE_INMUX1;
            __IO uint32_t EZH_SLICE_INMUX2;
            __IO uint32_t EZH_SLICE_INMUX3;
            __IO uint32_t EZH_SLICE_INMUX4;
            __IO uint32_t EZH_SLICE_INMUX5;
            __IO uint32_t EZH_SLICE_INMUX6;
            __IO uint32_t EZH_SLICE_INMUX7;
        };
        __IO uint32_t EZH_SLICE_INMUX[8];
    };

    union {     /* 0x0C0 */
        struct {
            __IO uint32_t PINTSEL0;
            __IO uint32_t PINTSEL1;
            __IO uint32_t PINTSEL2;
            __IO uint32_t PINTSEL3;
            __IO uint32_t PINTSEL4;
            __IO uint32_t PINTSEL5;
            __IO uint32_t PINTSEL6;
            __IO uint32_t PINTSEL7;
        };
        __IO uint32_t PINTSEL[8];
    };

    union {     /* 0x0E0 */
        struct {
            __IO uint32_t DMA_ITRIG_INMUX0;
            __IO uint32_t DMA_ITRIG_INMUX1;
            __IO uint32_t DMA_ITRIG_INMUX2;
            __IO uint32_t DMA_ITRIG_INMUX3;
            __IO uint32_t DMA_ITRIG_INMUX4;
            __IO uint32_t DMA_ITRIG_INMUX5;
            __IO uint32_t DMA_ITRIG_INMUX6;
            __IO uint32_t DMA_ITRIG_INMUX7;
            __IO uint32_t DMA_ITRIG_INMUX8;
            __IO uint32_t DMA_ITRIG_INMUX9;
            __IO uint32_t DMA_ITRIG_INMUX10;
            __IO uint32_t DMA_ITRIG_INMUX11;
            __IO uint32_t DMA_ITRIG_INMUX12;
            __IO uint32_t DMA_ITRIG_INMUX13;
            __IO uint32_t DMA_ITRIG_INMUX14;
            __IO uint32_t DMA_ITRIG_INMUX15;
            __IO uint32_t DMA_ITRIG_INMUX16;
            __IO uint32_t DMA_ITRIG_INMUX17;
            __IO uint32_t DMA_ITRIG_INMUX18;
            __IO uint32_t DMA_ITRIG_INMUX19;
            __IO uint32_t DMA_ITRIG_INMUX20;
            __IO uint32_t DMA_ITRIG_INMUX21;
        };
        __IO uint32_t DMA_ITRIG_INMUX[22];
    };

    __I  uint32_t RESERVED138[(0x160-0x138)/4];

    union {     /* 0x160 */
        struct {
            __IO uint32_t DMA_OTRIG_INMUX0;
            __IO uint32_t DMA_OTRIG_INMUX1;
            __IO uint32_t DMA_OTRIG_INMUX2;
            __IO uint32_t DMA_OTRIG_INMUX3;
        };
        __IO uint32_t DMA_OTRIG_INMUX[4];
    };

    __I  uint32_t RESERVED170[(0x180-0x170)/4];

    __IO uint32_t FREQMEAS_REF;
    __IO uint32_t FREQMEAS_TARGET;
} LPC_INPUTMUX_t;


// ------------------------------------------------------------------------------------------------
// -----                                       IOCONFIG                                       -----
// ------------------------------------------------------------------------------------------------

typedef struct {
    __IO uint32_t PIO0_0;
    __IO uint32_t PIO0_1;
    __IO uint32_t PIO0_2;
    __IO uint32_t PIO0_3;
    __IO uint32_t PIO0_4;
    __IO uint32_t PIO0_5;
    __IO uint32_t PIO0_6;
    __IO uint32_t PIO0_7;
    __IO uint32_t PIO0_8;
    __IO uint32_t PIO0_9;
    __IO uint32_t PIO0_10;
    __IO uint32_t PIO0_11;
    __IO uint32_t PIO0_12;
    __IO uint32_t PIO0_13;
    __IO uint32_t PIO0_14;
    __IO uint32_t PIO0_15;
    __IO uint32_t PIO0_16;
    __IO uint32_t PIO0_17;
    __IO uint32_t PIO0_18;
    __IO uint32_t PIO0_19;
    __IO uint32_t PIO0_20;
    __IO uint32_t PIO0_21;
    __IO uint32_t PIO0_22;
    __IO uint32_t PIO0_23;
    __IO uint32_t PIO0_24;
    __IO uint32_t PIO0_25;
    __IO uint32_t PIO0_26;
    __IO uint32_t PIO0_27;
    __IO uint32_t PIO0_28;
    __IO uint32_t PIO0_29;
    __IO uint32_t PIO0_30;
    __IO uint32_t PIO0_31;
    __IO uint32_t PIO1_0;
    __IO uint32_t PIO1_1;
    __IO uint32_t PIO1_2;
    __IO uint32_t PIO1_3;
    __IO uint32_t PIO1_4;
    __IO uint32_t PIO1_5;
    __IO uint32_t PIO1_6;
    __IO uint32_t PIO1_7;
    __IO uint32_t PIO1_8;
    __IO uint32_t PIO1_9;
    __IO uint32_t PIO1_10;
    __IO uint32_t PIO1_11;
    __IO uint32_t PIO1_12;
    __IO uint32_t PIO1_13;
    __IO uint32_t PIO1_14;
    __IO uint32_t PIO1_15;
    __IO uint32_t PIO1_16;
    __IO uint32_t PIO1_17;
} LPC_IOCON_Type;


// ------------------------------------------------------------------------------------------------
// -----                                     Mailbox                                          -----
// ------------------------------------------------------------------------------------------------

typedef struct
{
    __IO uint32_t IRQ0;
    __O  uint32_t IRQ0SET;
    __O  uint32_t IRQ0CLR;
    __I  uint32_t RESERVED00C[(0x010-0x00C)/4];
    __IO uint32_t IRQ1;
    __O  uint32_t IRQ1SET;
    __O  uint32_t IRQ1CLR;
    __I  uint32_t RESERVED01C[(0x0F8-0x01C)/4];
    __IO uint32_t MUTEX;
} LPC_MAILBOX_Type;


// ------------------------------------------------------------------------------------------------
// -----                                          RTC                                         -----
// ------------------------------------------------------------------------------------------------

