einergehtnochrein/ra-firmware/core/Device/NXP/LPC54xxx/Include/LPC5411x.h
    __IO struct {                       /* 0x500-0x57C  SCTOUT[i].SET / SCTOUT[i].CLR */
        uint32_t SET;                   /* Output n Set Register */
        uint32_t CLR;                   /* Output n Clear Register */
    } OUT[CONFIG_SCT_nOU];

         uint32_t RESERVED10[191-2*CONFIG_SCT_nOU];   /* ...-0x7F8 reserved */

    __I  uint32_t MODULECONTENT;        /* 0x7FC Module Content */

} LPC_SCT0_Type;


// ------------------------------------------------------------------------------------------------
// -----                                        SPI                                           -----
// ------------------------------------------------------------------------------------------------

typedef struct {
    __I  uint32_t RESERVED000[(0x400-0x000)/4];
    __IO uint32_t CFG;
    __IO uint32_t DLY;
    __IO uint32_t STAT;
    __IO uint32_t INTENSET;
    __O  uint32_t INTENCLR;
    __I  uint32_t RESERVED414[(0x424-0x414)/4];
    __IO uint32_t DIV;
    __I  uint32_t INTSTAT;
    __I  uint32_t RESERVED42C[(0xE00-0x42C)/4];
    __IO uint32_t FIFOCFG;
    __IO uint32_t FIFOSTAT;
    __IO uint32_t FIFOTRIG;
    __I  uint32_t RESERVEDE0C[(0xE10-0xE0C)/4];
    __IO uint32_t FIFOINTENSET;
    __IO uint32_t FIFOINTENCLR;
    __I  uint32_t FIFOINTSTAT;
    __I  uint32_t RESERVEDE1C[(0xE20-0xE1C)/4];
    union {
        __O  uint32_t FIFOWR;
        struct {
            __O  uint16_t FIFOWR_TXDATA16;
            __O  uint16_t FIFOWR_CTRL16;
        };
    };
    __I  uint32_t RESERVEDE24[(0xE30-0xE24)/4];
    __I  uint32_t FIFORD;
    __I  uint32_t RESERVEDE34[(0xE40-0xE34)/4];
    __I  uint32_t FIFORDNOPOP;
} LPC_SPI_Type;


// ------------------------------------------------------------------------------------------------
// -----                                 SYSCONEXTRA                                          -----
// ------------------------------------------------------------------------------------------------

typedef struct
{
    __I  uint32_t RESERVED000[(0x044-0x000)/4];
    __IO uint32_t BODCTRL;
} LPC_SYSCONEXTRA_Type;


// ------------------------------------------------------------------------------------------------
// -----                                        Timer                                       -----
// ------------------------------------------------------------------------------------------------

typedef struct {
    __IO uint32_t IR;
    __IO uint32_t TCR;
    __IO uint32_t TC;
    __IO uint32_t PR;
    __IO uint32_t PC;
    __IO uint32_t MCR;
    union {
        __IO uint32_t MR[4];
        struct{
            __IO uint32_t MR0;
            __IO uint32_t MR1;
            __IO uint32_t MR2;
            __IO uint32_t MR3;
        };
    };
    __IO uint32_t CCR;
    union{
        __I  uint32_t CR[4];
        struct{
            __I  uint32_t CR0;
            __I  uint32_t CR1;
            __I  uint32_t CR2;
            __I  uint32_t CR3;
        };
    };
    __IO uint32_t EMR;
    __I  uint32_t RESERVED040[(0x070-0x040)/4];
    __IO uint32_t CTCR;
    __IO uint32_t PWMC;
} LPC_TIMER_Type;


// ------------------------------------------------------------------------------------------------
// -----                                         UART                                         -----
// ------------------------------------------------------------------------------------------------

typedef struct {
    __IO uint32_t CFG;
    __IO uint32_t CTL;
    __IO uint32_t STAT;
    __IO uint32_t INTENSET;
    __O  uint32_t INTENCLR;
    __I  uint32_t RXDAT;
    __I  uint32_t RXDATSTAT;
    __IO uint32_t TXDAT;
    __IO uint32_t BRG;
    __IO uint32_t INTSTAT;
    __IO uint32_t OSR;
    __IO uint32_t ADDR;
    __I  uint32_t RESERVED030[(0xE00-0x030)/4];
    __IO uint32_t FIFOCFG;
    __IO uint32_t FIFOSTAT;
    __IO uint32_t FIFOTRIG;
    __I  uint32_t RESERVEDE0C[(0xE10-0xE0C)/4];
    __IO uint32_t FIFOINTENSET;
    __IO uint32_t FIFOINTENCLR;
    __I  uint32_t FIFOINTSTAT;
    __I  uint32_t RESERVEDE1C[(0xE20-0xE1C)/4];
    __O  uint32_t FIFOWR;
    __I  uint32_t RESERVEDE24[(0xE30-0xE24)/4];
    __I  uint32_t FIFORD;
    __I  uint32_t RESERVEDE34[(0xE40-0xE34)/4];
    __I  uint32_t FIFORDNOPOP;
} LPC_UART_Type;


// ------------------------------------------------------------------------------------------------
// -----                                         WWDT                                         -----
// ------------------------------------------------------------------------------------------------

typedef struct {
    __IO uint32_t MOD;
    __IO uint32_t TC;
    __IO uint32_t FEED;
    __I  uint32_t TV;
    __IO uint32_t CLKSEL;
    __IO uint32_t WARNINT;
    __IO uint32_t WINDOW;
} LPC_WWDT_Type;





typedef struct
{
    __IO uint32_t ASYNCPRESETCTRL;
    __O  uint32_t ASYNCPRESETCTRLSET;
    __O  uint32_t ASYNCPRESETCTRLCLR;
    __I  uint32_t RESERVED00C[(0x010-0x00C)/4];
    __IO uint32_t ASYNCAPBCLKCTRL;
    __O  uint32_t ASYNCAPBCLKCTRLSET;
    __O  uint32_t ASYNCAPBCLKCTRLCLR;
    __I  uint32_t RESERVED01C[(0x020-0x01C)/4];
    __IO uint32_t ASYNCAPBCLKSELA;
} LPC_ASYNCSYSCON_Type;



typedef struct
{
    __I  uint32_t RESERVED000[(0x010-0x000)/4];
    __IO uint32_t AHBMATPRIO;
    __I  uint32_t RESERVED014[(0x040-0x014)/4];
    __IO uint32_t SYSTCKCAL;
    __I  uint32_t RESERVED044[(0x048-0x044)/4];
    __IO uint32_t NMISRC;
    __IO uint32_t ASYNCAPBCTRL;
    __I  uint32_t RESERVED050[(0x0C0-0x050)/4];
    union {
        __I  uint32_t PIOPORCAP[2];
        struct {
            __I  uint32_t PIOPORCAP0;
            __I  uint32_t PIOPORCAP1;
        };
    };
    __I  uint32_t RESERVED0C8[(0x0D0-0x0C8)/4];
    union {
        __I  uint32_t PIORESCAP[2];
        struct {
            __I  uint32_t PIORESCAP0;
            __I  uint32_t PIORESCAP1;
        };
    };
    __I  uint32_t RESERVED0D8[(0x100-0x0D8)/4];
    union {
        __IO uint32_t PRESETCTRL[2];
        struct {
            __IO uint32_t PRESETCTRL0;
            __IO uint32_t PRESETCTRL1;
        };
    };
    __I  uint32_t RESERVED108[(0x120-0x108)/4];
    union {
        __O  uint32_t PRESETCTRLSET[2];
        struct {
            __O  uint32_t PRESETCTRLSET0;
            __O  uint32_t PRESETCTRLSET1;
        };
    };
    __I  uint32_t RESERVED128[(0x140-0x128)/4];
    union {
        __O  uint32_t PRESETCTRLCLR[2];
        struct {
            __O  uint32_t PRESETCTRLCLR0;
            __O  uint32_t PRESETCTRLCLR1;
        };
    };
    __I  uint32_t RESERVED148[(0x1F0-0x148)/4];
    __IO uint32_t SYSRSTSTAT;
    __I  uint32_t RESERVED1F4[(0x200-0x1F4)/4];
    union {
        __IO uint32_t AHBCLKCTRL[2];
        struct {
            __IO uint32_t AHBCLKCTRL0;
            __IO uint32_t AHBCLKCTRL1;
        };
    };
    __I  uint32_t RESERVED208[(0x220-0x208)/4];
    union {
        __O  uint32_t AHBCLKCTRLSET[2];
        struct {
            __O  uint32_t AHBCLKCTRLSET0;
            __O  uint32_t AHBCLKCTRLSET1;
        };
    };
    __I  uint32_t RESERVED228[(0x240-0x228)/4];
    union {
        __O  uint32_t AHBCLKCTRLCLR[2];
        struct {
            __O  uint32_t AHBCLKCTRLCLR0;
            __O  uint32_t AHBCLKCTRLCLR1;
        };
    };
    __I  uint32_t RESERVED248[(0x280-0x248)/4];
    __IO uint32_t MAINCLKSELA;
    __IO uint32_t MAINCLKSELB;
    __IO uint32_t CLKOUTSELA;
    __I  uint32_t RESERVED28C[(0x290-0x28C)/4];
    __IO uint32_t SYSPLLCLKSEL;
    __I  uint32_t RESERVED294[(0x2A4-0x294)/4];
    __IO uint32_t ADCCLKSEL;
    __IO uint32_t USBCLKSEL;
    __I  uint32_t RESERVED2AC[(0x2B0-0x2AC)/4];
    union {
        __O  uint32_t FCLKSEL[8];
        struct {
            __O  uint32_t FCLKSEL0;
            __O  uint32_t FCLKSEL1;
            __O  uint32_t FCLKSEL2;
            __O  uint32_t FCLKSEL3;
            __O  uint32_t FCLKSEL4;
            __O  uint32_t FCLKSEL5;
            __O  uint32_t FCLKSEL6;
            __O  uint32_t FCLKSEL7;
        };
    };
    __I  uint32_t RESERVED2D0[(0x2E0-0x2D0)/4];
    __IO uint32_t MCLKCLKSEL;
    __I  uint32_t RESERVED2E4[(0x2E8-0x2E4)/4];
    __IO uint32_t FRGCLKSEL;
    __IO uint32_t DMICCLKSEL;
    __I  uint32_t RESERVED2F0[(0x300-0x2F0)/4];
    __IO uint32_t SYSTICKCLKDIV;
    __IO uint32_t TRACECLKDIV;
    __I  uint32_t RESERVED308[(0x380-0x308)/4];
    __IO uint32_t AHBCLKDIV;
    __IO uint32_t CLKOUTDIV;
    __I  uint32_t RESERVED388[(0x394-0x388)/4];
    __IO uint32_t ADCCLKDIV;
    __IO uint32_t USBCLKDIV;
    __I  uint32_t RESERVED39C[(0x3A0-0x39C)/4];
    __IO uint32_t FRGCTRL;
    __I  uint32_t RESERVED3A4[(0x3A8-0x3A4)/4];
    __IO uint32_t DMICCLKDIV;
    __IO uint32_t I2SMCLKDIV;
    __I  uint32_t RESERVED3B0[(0x400-0x3B0)/4];
    __IO uint32_t FLASHCFG;
    __I  uint32_t RESERVED404[(0x40C-0x404)/4];
    __IO uint32_t USBCLKCTRL;
    __I  uint32_t USBCLKSTAT;
    __IO uint32_t EZHINT;
    __IO uint32_t FREQMECTRL;
    __I  uint32_t RESERVED41C[(0x420-0x41C)/4];
    __IO uint32_t MCLKIO;
    __I  uint32_t RESERVED424[(0x500-0x424)/4];
    __IO uint32_t FROCTRL;
    __I  uint32_t RESERVED504[(0x508-0x504)/4];
    __IO uint32_t WDTOSCCTRL;
    __IO uint32_t RTCOSCCTRL;
    __I  uint32_t RESERVED510[(0x580-0x510)/4];
    __IO uint32_t SYSPLLCTRL;
    __I  uint32_t SYSPLLSTAT;
    __IO uint32_t SYSPLLNDEC;
    __IO uint32_t SYSPLLPDEC;
    __IO uint32_t SYSPLLSSCTRL0;
    __IO uint32_t SYSPLLSSCTRL1;
    __I  uint32_t RESERVED598[(0x600-0x598)/4];
    __IO uint32_t PDSLEEPCFG0;
    __I  uint32_t RESERVED604[(0x610-0x604)/4];
    __IO uint32_t PDRUNCFG0;
    __I  uint32_t RESERVED614[(0x620-0x614)/4];
    __O  uint32_t PDRUNCFGSET0;
    __I  uint32_t RESERVED624[(0x630-0x624)/4];
    __O  uint32_t PDRUNCFGCLR0;
    __I  uint32_t RESERVED634[(0x680-0x634)/4];
    union {
        __IO uint32_t STARTER[2];
        struct {
            __IO uint32_t STARTER0;
            __IO uint32_t STARTER1;
        };
    };
    __I  uint32_t RESERVED688[(0x6A0-0x688)/4];
    union {
        __O  uint32_t STARTERSET[2];
        struct {
            __O  uint32_t STARTERSET0;
            __O  uint32_t STARTERSET1;
        };
    };
    __I  uint32_t RESERVED6A8[(0x6C0-0x6A8)/4];
    union {
        __O  uint32_t STARTERCLR[2];
        struct {
            __O  uint32_t STARTERCLR0;
            __O  uint32_t STARTERCLR1;
        };
    };
    __I  uint32_t RESERVED6C8[(0x780-0x6C8)/4];
    __IO uint32_t HWWAKE;
    __I  uint32_t RESERVED784[(0x800-0x784)/4];
    __IO uint32_t CPUCTRL;
    __IO uint32_t CPBOOT;
    __IO uint32_t CPSTACK;
    __I  uint32_t CPSTAT;
    __I  uint32_t RESERVED810[(0xE04-0x810)/4];
    __IO uint32_t AUTOCGOR;
    __I  uint32_t RESERVEDE08[(0xFF4-0xE08)/4];
    __I  uint32_t JTAGIDCODE;
    __I  uint32_t DEVICE_ID0;
    __I  uint32_t DEVICE_ID1;
} LPC_SYSCON_Type;


// ------------------------------------------------------------------------------------------------
// -----                                          USB                                         -----
// ------------------------------------------------------------------------------------------------

