einergehtnochrein/ra-firmware/core/Device/NXP/LPC54xxx/Include/LPC5411x.h
typedef struct {
    __IO uint32_t DEVCMDSTAT;
    __IO uint32_t INFO;
    __IO uint32_t EPLISTSTART;
    __IO uint32_t DATABUFSTART;
    __IO uint32_t LPM;
    __IO uint32_t EPSKIP;
    __IO uint32_t EPINUSE;
    __IO uint32_t EPBUFCFG;
    __IO uint32_t INTSTAT;
    __IO uint32_t INTEN;
    __IO uint32_t INTSETSTAT;
    __I  uint32_t RESERVED02C[(0x034-0x02C)/4];
    __I  uint32_t EPTOGGLE;
} LPC_USB_Type;


// ------------------------------------------------------------------------------------------------
// -----                                 Peripheral memory map                                -----
// ------------------------------------------------------------------------------------------------

#define LPC_FLASH_BASE        (0x00000000UL)
#define LPC_SRAM0_BASE        (0x20000000UL)
#define LPC_SRAM1_BASE        (0x20010000UL)
#define LPC_SRAM2_BASE        (0x20020000UL)
#define LPC_SRAMX_BASE        (0x04000000UL)
#define LPC_APB0_BASE         (0x40000000UL)
#define LPC_APB1_BASE         (0x40020000UL)
#define LPC_APBASYNCH_BASE    (0x40040000UL)
#define LPC_AHB_BASE          (0x40080000UL)
#define LPC_CM4_BASE          (0xE0000000UL)

/* APB0 peripherals                                                           */
#define LPC_SYSCON_BASE       (LPC_APB0_BASE + 0x00000)
#define LPC_IOCON_BASE        (LPC_APB0_BASE + 0x01000)
#define LPC_GINT0_BASE        (LPC_APB0_BASE + 0x02000)
#define LPC_GINT1_BASE        (LPC_APB0_BASE + 0x03000)
#define LPC_PINT_BASE         (LPC_APB0_BASE + 0x04000)
#define LPC_INPUTMUX_BASE     (LPC_APB0_BASE + 0x05000)
#define LPC_TIM0_BASE         (LPC_APB0_BASE + 0x08000)
#define LPC_TIM1_BASE         (LPC_APB0_BASE + 0x09000)
#define LPC_WWDT_BASE         (LPC_APB0_BASE + 0x0C000)
#define LPC_MRT_BASE          (LPC_APB0_BASE + 0x0D000)
#define LPC_UTICK_BASE        (LPC_APB0_BASE + 0x0E000)

/* APB1 peripherals                                                           */
#define LPC_SYSCONEXTRA_BASE  (LPC_APB1_BASE + 0x00000)
#define LPC_TIM2_BASE         (LPC_APB1_BASE + 0x08000)
#define LPC_RTC_BASE          (LPC_APB1_BASE + 0x0C000)
#define LPC_FLASHCTRL_BASE    (LPC_APB1_BASE + 0x14080)

/* APBASYNCH peripherals                                                           */
#define LPC_ASYNCSYSCON_BASE  (LPC_APBASYNCH_BASE + 0x00000)
#define LPC_TIM3_BASE         (LPC_APBASYNCH_BASE + 0x08000)
#define LPC_TIM4_BASE         (LPC_APBASYNCH_BASE + 0x09000)

/* AHB peripherals                                                            */
#define LPC_DMA_BASE          (LPC_AHB_BASE  + 0x02000)
#define LPC_USB_BASE          (LPC_AHB_BASE  + 0x04000)
#define LPC_SCT0_BASE         (LPC_AHB_BASE  + 0x05000)
#define LPC_FLEXCOMM0_BASE    (LPC_AHB_BASE  + 0x06000)
#define LPC_FLEXCOMM1_BASE    (LPC_AHB_BASE  + 0x07000)
#define LPC_FLEXCOMM2_BASE    (LPC_AHB_BASE  + 0x08000)
#define LPC_FLEXCOMM3_BASE    (LPC_AHB_BASE  + 0x09000)
#define LPC_FLEXCOMM4_BASE    (LPC_AHB_BASE  + 0x0A000)
#define LPC_MAILBOX_BASE      (LPC_AHB_BASE  + 0x0B000)
#define LPC_GPIO_BASE         (LPC_AHB_BASE  + 0x0C000)
#define LPC_DMIC_BASE         (LPC_AHB_BASE  + 0x10000)
#define LPC_CRC_BASE          (LPC_AHB_BASE  + 0x15000)
#define LPC_FLEXCOMM5_BASE    (LPC_AHB_BASE  + 0x16000)
#define LPC_FLEXCOMM6_BASE    (LPC_AHB_BASE  + 0x17000)
#define LPC_FLEXCOMM7_BASE    (LPC_AHB_BASE  + 0x18000)
#define LPC_ISPAP_BASE        (LPC_AHB_BASE  + 0x1C000)
#define LPC_ADC0_BASE         (LPC_AHB_BASE  + 0x20000)


// ------------------------------------------------------------------------------------------------
// -----                                Peripheral declaration                                -----
// ------------------------------------------------------------------------------------------------

#define LPC_ADC0              ((LPC_ADC_Type            *) LPC_ADC0_BASE     )
#define LPC_ASYNCSYSCON       ((LPC_ASYNCSYSCON_Type    *) LPC_ASYNCSYSCON_BASE)
#define LPC_CRC               ((LPC_CRC_Type            *) LPC_CRC_BASE      )
#define LPC_DMA               ((LPC_DMA_Type            *) LPC_DMA_BASE      )
#define LPC_DMIC              ((LPC_DMIC_Type           *) LPC_DMIC_BASE     )
#define LPC_FLASHCTRL         ((LPC_FLASHCTRL_Type      *) LPC_FLASHCTRL_BASE)
#define LPC_FLEXCOMM0         ((LPC_FLEXCOMM_Type       *) LPC_FLEXCOMM0_BASE)
#define LPC_FLEXCOMM1         ((LPC_FLEXCOMM_Type       *) LPC_FLEXCOMM1_BASE)
#define LPC_FLEXCOMM2         ((LPC_FLEXCOMM_Type       *) LPC_FLEXCOMM2_BASE)
#define LPC_FLEXCOMM3         ((LPC_FLEXCOMM_Type       *) LPC_FLEXCOMM3_BASE)
#define LPC_FLEXCOMM4         ((LPC_FLEXCOMM_Type       *) LPC_FLEXCOMM4_BASE)
#define LPC_FLEXCOMM5         ((LPC_FLEXCOMM_Type       *) LPC_FLEXCOMM5_BASE)
#define LPC_FLEXCOMM6         ((LPC_FLEXCOMM_Type       *) LPC_FLEXCOMM6_BASE)
#define LPC_FLEXCOMM7         ((LPC_FLEXCOMM_Type       *) LPC_FLEXCOMM7_BASE)
#define LPC_GINT0             ((LPC_GPIO_GROUP_INT_Type *) LPC_GINT0_BASE    )
#define LPC_GINT1             ((LPC_GPIO_GROUP_INT_Type *) LPC_GINT1_BASE    )
#define LPC_GPIO              ((LPC_GPIO_Type           *) LPC_GPIO_BASE     )
#define LPC_I2C0              ((LPC_I2C_Type            *) LPC_FLEXCOMM0_BASE)
#define LPC_I2C1              ((LPC_I2C_Type            *) LPC_FLEXCOMM1_BASE)
#define LPC_I2C2              ((LPC_I2C_Type            *) LPC_FLEXCOMM2_BASE)
#define LPC_I2C3              ((LPC_I2C_Type            *) LPC_FLEXCOMM3_BASE)
#define LPC_I2C4              ((LPC_I2C_Type            *) LPC_FLEXCOMM4_BASE)
#define LPC_I2C5              ((LPC_I2C_Type            *) LPC_FLEXCOMM5_BASE)
#define LPC_I2C6              ((LPC_I2C_Type            *) LPC_FLEXCOMM6_BASE)
#define LPC_I2C7              ((LPC_I2C_Type            *) LPC_FLEXCOMM7_BASE)
#define LPC_INPUTMUX          ((LPC_INPUTMUX_t          *) LPC_INPUTMUX_BASE )
#define LPC_IOCON             ((LPC_IOCON_Type          *) LPC_IOCON_BASE    )
#define LPC_MAILBOX           ((LPC_MAILBOX_Type        *) LPC_MAILBOX_BASE  )
#define LPC_MRT               ((LPC_MRT_TypeDef         *) LPC_MRT_BASE      )
#define LPC_OSTIMER           ((LPC_OSTIMER_Type        *) LPC_OSTIMER_BASE  )
#define LPC_PINT              ((LPC_GPIO_PIN_INT_Type   *) LPC_PINT_BASE     )
#define LPC_RTC               ((LPC_RTC_Type            *) LPC_RTC_BASE      )
#define LPC_SCT0              ((LPC_SCT0_Type           *) LPC_SCT0_BASE     )
#define LPC_SPI0              ((LPC_SPI_Type            *) LPC_FLEXCOMM0_BASE)
#define LPC_SPI1              ((LPC_SPI_Type            *) LPC_FLEXCOMM1_BASE)
#define LPC_SPI2              ((LPC_SPI_Type            *) LPC_FLEXCOMM2_BASE)
#define LPC_SPI3              ((LPC_SPI_Type            *) LPC_FLEXCOMM3_BASE)
#define LPC_SPI4              ((LPC_SPI_Type            *) LPC_FLEXCOMM4_BASE)
#define LPC_SPI5              ((LPC_SPI_Type            *) LPC_FLEXCOMM5_BASE)
#define LPC_SPI6              ((LPC_SPI_Type            *) LPC_FLEXCOMM6_BASE)
#define LPC_SPI7              ((LPC_SPI_Type            *) LPC_FLEXCOMM7_BASE)
#define LPC_SYSCON            ((LPC_SYSCON_Type         *) LPC_SYSCON_BASE   )
#define LPC_SYSCONEXTRA       ((LPC_SYSCONEXTRA_Type    *) LPC_SYSCONEXTRA_BASE)
#define LPC_TIMER0            ((LPC_TIMER_Type          *) LPC_TIM0_BASE     )
#define LPC_TIMER1            ((LPC_TIMER_Type          *) LPC_TIM1_BASE     )
#define LPC_TIMER2            ((LPC_TIMER_Type          *) LPC_TIM2_BASE     )
#define LPC_TIMER3            ((LPC_TIMER_Type          *) LPC_TIM3_BASE     )
#define LPC_TIMER4            ((LPC_TIMER_Type          *) LPC_TIM4_BASE     )
#define LPC_UART0             ((LPC_UART_Type           *) LPC_FLEXCOMM0_BASE)
#define LPC_UART1             ((LPC_UART_Type           *) LPC_FLEXCOMM1_BASE)
#define LPC_UART2             ((LPC_UART_Type           *) LPC_FLEXCOMM2_BASE)
#define LPC_UART3             ((LPC_UART_Type           *) LPC_FLEXCOMM3_BASE)
#define LPC_UART4             ((LPC_UART_Type           *) LPC_FLEXCOMM4_BASE)
#define LPC_UART5             ((LPC_UART_Type           *) LPC_FLEXCOMM5_BASE)
#define LPC_UART6             ((LPC_UART_Type           *) LPC_FLEXCOMM6_BASE)
#define LPC_UART7             ((LPC_UART_Type           *) LPC_FLEXCOMM7_BASE)
#define LPC_USART0            LPC_UART0
#define LPC_USART1            LPC_UART1
#define LPC_USART2            LPC_UART2
#define LPC_USART3            LPC_UART3
#define LPC_USART4            LPC_UART4
#define LPC_USART5            LPC_UART5
#define LPC_USART6            LPC_UART6
#define LPC_USART7            LPC_UART7
#define LPC_USB0              ((LPC_USB_Type            *) LPC_USB_BASE      )
#define LPC_UTICK             ((LPC_UTICK_Type          *) LPC_UTICK_BASE    )
#define LPC_WWDT              ((LPC_WWDT_Type           *) LPC_WWDT_BASE     )

#endif  // __LPC541xx_H__

